[
  {
    "main_text": "Xiaomi Europe was founded in 2010 to provide International users an exclusive community for English MIUI Android ROM and Xiaomi products. Since then their web site has officially worked with Xiaomi on a variety of projects for APP translations and bug fixing and is a major part of today's Xiaomi Global ROM experience thanks to the great team at xiaomi.eu and its community.",
    "additional_text": "The oldest available rom at this point is from Jul 31, 2015 It is MIUI 6 based stable version for devices as: Mi 4, Mi 3, Mi 4i, Mi Note, Mi Note Pro, Mi Pad 7.9, Redmi Note 4G, Redmi Note Prime, Redmi 2. \nIf you are curious or you have some of these devices, this is where the ROM files are: https://androidfilehost.com/?w=files&flid=42334"
  },
  {
    "main_text": "Oldest xiaomi.eu weekly rom available is from Feb 19, 2016 with code name 6.2.18 and it is only for two models: Redmi note 2 and Redmi note 3 MTK",
    "additional_text": "The rom is still available for downloading on AndroidFileHost.com: \nhttps://androidfilehost.com/?w=files&flid=50287"
  },
  {
    "main_text": "All Xiaomi weekly ROMs are date based. Until MIUI 14 the format was Year.Month.Day so you can easily understand exactly when the ROM was released: \n6.2.18 -> Feb 18 2016, \n9.9.6 -> Sep 6 2019, \n22.8.3 -> Aug 3 2022.",
    "additional_text": "From Jan 3 2023 new \"numeration\" was absorbed: \nV14.0.23.1.3.DEV which means MIUI 14.0 Jan 3 2023, Developer version"
  },
  {
    "main_text": "Orange Friday is a weekly occurrence at Xiaomi where the company allows users to give feedback on forums after the software update for the developer ROM of MIUI that day. After purchasing a Xiaomi cellphone, consumers can become a part of an active community to voice their opinions and give feedback on product updates.",
    "additional_text": "At this point you can get the latest weekly ROM from xiaomi.eu on Saturday in the morning, but the actual date of release (because it depends on when the China Dev ROM will be available) is few days earlier. For example: \nV14.0.23.7.3.DEV is released in China on Jul 3 2023, but it is available for downloading on SourceForge servers оn Jul 7 and 8"
  },
  {
    "main_text": "Back in time all that you need for installing xiaomi.eu ROM was TWRP, but nowadays it isn't that easy to get it. Back in 2015, following android security policy, Xiaomi started to lock the bootloaders of the new devices. The first batch was Mi Note Pro, Mi 4c, Redmi Note 3 MTK, etc. So, to install custom recovery you need to unlock your device's bootloader, which was connected with waiting from 0 to 30 days in order to receive permission to unlock.",
    "additional_text": "In 2023 we have hybrid ROM that works for installation with TWRP or fastboot. Of course the unlocking of the device is still necessary, and Mediatek devices are not supported, because of a lot of bricked phones that are using their chipsets"
  },
  {
    "main_text": "Latest (final) weekly rom is HyperOS 1.0 24.7.28 and it is not available to download from xiaomi.eu servers anymore.",
    "additional_text": "The numeration is OS1.0.24.7.28.DEV which means HyperOS 1.0 July 28 2024, Developer version and it is supported by only 17 devices"
  }
]
